app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: :ok

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def sign_up # same as create
    user = User.new(**user_params)

    if user.save!

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test_2@email.com"], ["LIMIT", 1]]
---
  def auth
    user = User.find_by(email: user_params[:email])